weekly-exercises/03.tex
% Created 2019-03-20 Wed 17:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper, margin=2cm]{geometry}
\usepackage{indentfirst}
\usepackage[, brazilian]{babel}
\usepackage{float}
\usepackage{color, colortbl}
\usepackage{titling}
\setlength{\droptitle}{-1.5cm}
\hypersetup{ colorlinks = true, urlcolor = blue }
\usemintedstyle{murphy}
\definecolor{beige}{rgb}{0.93,0.93,0.82}
\definecolor{brown}{rgb}{0.4,0.2,0.0}
\author{Fernanda Guimarães - 2016058166}
\date{}
\title{Exercício 03 - (entrega 25/03)}
\hypersetup{
 pdfauthor={Fernanda Guimarães - 2016058166},
 pdftitle={Exercício 03 - (entrega 25/03)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2)}, 
 pdflang={Brazilian}}
\begin{document}

\maketitle

\section{Q1}
\label{sec:orgd9b4918}
Atrasar a entrega é um mal hábido que é duplamente viciante e danoso. O jeito mais
difícil de lidar com muito o que fazer é adiar a funcionalidade. Porque é mais difícil e
mais importante para praticar fazendo. Às vezes pode ser melhor atrasar a data de
entrega. É a decisão do cliente. Isso envolve muitas questões fora do escopo do
planejamento do projeto. Muitas vezes você pode fazer essas difíceis escolhas apenas
quando as datas maiores aparecerem, e, sem prática, não pode fazer isso sob
pressão.

\section{Q2}
\label{sec:orgda5c00f}
Existem algumas tarefas puramente técnicas com que o cliente não se importa, mas que
ainda precisam ser feitas. Estas incluem a instalação da atualização do banco de dados
do fornecedor, refatorando alguns problemas do sistema, experimentando uma ideia de
design para saber se será útil, e melhorando o processo de controle de configuração. É
importante manter cada tarefa pequena, ou seja, dividir o trabalho em tarefas de alguns
dias.

\section{Q3}
\label{sec:orgcd254ff}
Você precisa monitorar a iteração em intervalos regulares. Você precisa ter alguém cujo
trabalho é acompanhar o progresso de uma iteração. Nós chamamos essa pessoa de
\emph{tracker}.

\section{Q4}
\label{sec:org99d682e}
No final de cada iteração, toda a equipe se reunia e observava os desenvolvedores
demonstrarem o trabalho em que cada um tinha sido envolvido nas três semanas anteriores.
Isso foi em parte para que todos pudessem se manter a par dos últimos desenvolvimentos,
e em parte como um impulso moral - é gratificante para a equipe desenvolvedor-cliente
mostrar o trabalho que fizeram juntos para o resto da equipe.

\section{Q5}
\label{sec:orgbcf3b63}

A iteração é feita na data definida no início. Uma iteração de duas semanas termina em
duas semanas, sem mas. Histórias que são feitas, são feitas. Histórias que não são
feitas são adiadas para serem consideradas para implementação na próxima reunião de
planejamento de iteração.

\section{Q6}
\label{sec:org8fd4d71}

Um relatório de bug é um pedido de alteração do o sistema implantado. Primeiro, 
determine se o bug é crítico (existem alguns bugs que não podem esperar até a próxima
iteração). Se não for crítico, registre-o em um cartão. Se a estimativa for mais que um
dia de esforço, trate o defeito como uma estória. Pouco antes da próxima reunião de
planejamento de iteração, o cliente deve levar os bugs pequeno desconhecidos e
priorizá-los.

\section{Q7}
\label{sec:org52834c7}

O contrato típico de \emph{outsourcing} fixa três das quatro variáveis:
\begin{itemize}
\item Escopo
\item Tempo
\item Custo
\end{itemize}

Infelizmente, é impossível consertar todas as quatro variáveis. Depois de ter uma
quantidade desconhecida de trabalho à espreita, o escopo, o tempo e o custo todos
explodem. Como a qualidade é a variável mais difícil de medida, as surpresas tendem a
ser absorvidas pela redução da qualidade.
\end{document}
